[
  {
    "name":"Carrot Fries",
    "ingredients": ["Carrot"],
    "hyperlink":"https://feedingmykid.com/recipe/carrot-fries-recipe/",
    "description": "4 large carrots,sprinkle of sea salt. Preheat oven to 450F, and spray baking sheet with non-stick cooking spray.Slice carrots into french-fry shapes, and place on baking sheet.Sprinkle sea salt over fries.Bake for 12 minutes. Enjoy!",
    "image": "https://feedingmykid.com/wp-content/uploads/2016/10/Carrot-Fries-2.jpg",
    "priority": 0
  },
  {
    "name":"Tomato Stew egg",
    "ingredients": ["Tomato", "Egg"],
    "hyperlink":"https://misschinesefood.com/tomato-stew-eggs/",
    "description": "Wash the tomatoes and dig a hole; Beat the eggs into a bowl, add some salt and stir; Pour the egg liquid into the tomatoes; Cover the tomato lid; Add water to the pot, boil, and put the tomatoes on the steaming rack; Close the lid; Take it out when steamed; Cut some green onions and sprinkle on the custard. Finally, you get home cooking tomato stew.",
    "image": "https://i2.supercook.com/e/5/6/a/e56a39cacdbe6ba55ea9451ab2d73a5f-0.jpg",
    "priority": 0
  },
  {
    "name":"Grilled Flat Iron Steak",
    "ingredients": ["Scallion", "Lemon","Beef"],
    "hyperlink":"https://honest-food.net/grilled-flat-iron-steak-recipe/",
    "description": "Salt your flat iron steaks on both sides and let them sit, uncovered, in the fridge up to overnight, and at least 1 hour. I like to set them on a rack over a tray to catch any juices. This preseasons your meat and will help develop a better crust on the grill. Get your grill very hot and clean and oil your grates as I described above. When you start this process, take your steaks out of the fridge to warm up a bit. You still want them cool, though, so no more than about 15 minutes. Grill your flat iron steaks hard on one side, a good 5 minutes without touching them. Flip and grill to the doneness you like, anywhere from 2 to 10 minutes, depending on the heat and the thickness of your steak. Use the finger test for doneness to determine this. Move your steaks from the grill, coat them with freshly cracked black pepper - or whatever spices and herbs you like - and let it rest 5 minutes. Slice across the grain (the narrow end), and squeeze citrus juice over it all.",
    "image": "https://honest-food.net/wp-content/uploads/2019/05/flat-iron-steak-recipe.jpg",
    "priority": 0
  },
  {
    "name":"Crispy Cracklin' Pork Picnic Shoulder",
    "ingredients": ["Pork"],
    "hyperlink":"https://dinnerthendessert.com/crispy-cracklin-pork-picnic-shoulder-slow-cooker-oven/",
    "description": "A foolproof EASY slow cooker and oven method for a shatteringly crisp Pork picnic shoulder that is pull apart tender on the inside with a thin crisp cracklin’ skin layer.",
    "image": "https://dinnerthendessert.com/wp-content/uploads/2015/07/Skin.jpg",
    "priority": 0
  },
  {
    "name":"Baked Chicken Thighs With Butter and Onions",
    "ingredients": ["Onion","Chicken","Butter"],
    "hyperlink":"https://www.washingtonpost.com/food/2021/04/30/baked-chicken-thighs-recipe-butter/",
    "description": "A super simple, hands-off recipe that is perfect for busy families. It’s great served with rice to sop up the delightful mix of butter, onions and chicken drippings created in the roasting pan.",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Y2Q6VUVIGAI6XKFHL5C53TPTMQ.jpg&w=1440",
    "priority": 0
  },
  {
    "name":"Zucchini Zoodles Homemade Marinara",
    "ingredients": ["Zucchini"],
    "hyperlink":"http://www.feedyoursoul2.com/zucchini-zoodles-homemade-marinara/",
    "description": "This is such an easy dish to put together.  The sauce takes close to two hours but that is counting the roasting of the garlic in the oven.  The real cooking time is 30 – 45 minutes and everything is assembled 5 – 10 minutes.  So once you have everything in your pan, you can get back to your Facebook or your TV. ",
    "image": "http://www.feedyoursoul2.com/wp-content/uploads/2017/09/Zucchini-Noodles-Homemade-Marainara-10-500.jpg",
    "priority": 0
  },
  {
    "name":"Simple Seared Salmon Recipe",
    "ingredients": ["Fish","Butter","Lemon"],
    "hyperlink":"https://www.winemag.com/recipe/simple-seared-salmon-recipe/",
    "description": "Look for fresh, wild-caught Pacific salmon for the cleanest taste and firmest texture. It will lend itself to any number of aromatics, like citrus fruits and side dishes like sautéed fennel with the gremolata or Brussels sprouts with the lemon butter. ",
    "image": "https://253qv1sx4ey389p9wtpp9sj0-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/Seared_Salmon_Pairings-700x461.jpg",
    "priority": 0
  },
  {
    "name":"CORN MILK",
    "ingredients": ["Corn","Milk"],
    "hyperlink":"https://www.chinayummyfood.com/corn-milk/",
    "description": "I usually use High Speed Blender to nake the milk corn, it is very easy and simple. You just need to put the ingredients in the blender and waiting for 20 minutes. And then, you can get hot and thick milk corn. It is very sweet and delicious! No thickener, the scent of the mouth is amazing!",
    "image": "https://www.chinayummyfood.com/wp-content/uploads/2019/09/Corn-Milk.jpg",
    "priority": 0
  },
  {
    "name":"Bacon Avocado Fries",
    "ingredients": ["Avocado","Bacon"],
    "hyperlink":"https://www.delish.com/cooking/recipe-ideas/recipes/a48261/bacon-avocado-fries-recipe/",
    "description":"Preheat oven to 425º. Slice each avocado into 8 equally-sized wedges. Wrap each wedge in bacon, cutting bacon if needed. Place on a baking sheet, seam side down. Bake until bacon is cooked through and crispy, 12 to 15 minutes. Serve with ranch dressing.",
    "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/delish-191907-bacon-wrapped-avocado-fries-0360-landscape-pf-1565884766.jpg?crop=0.668xw:1.00xh;0.146xw,0&resize=768:*",
    "priority": 0
  },
  {
    "name":"Cucumber-Avocado Salad",
    "ingredients": ["Cuumber","Avocado"],
    "hyperlink":"https://cooking.nytimes.com/recipes/1022411-cucumber-avocado-salad",
    "description": "Crunchy cucumbers and creamy avocados are the stars of this simple five-ingredient salad. Peeling the cucumbers in alternating stripes helps them soak up seasonings while maintaining their shape. After being cut into bite-size pieces, they are combined with salt to draw out moisture, concentrating their flavor. Cubed avocado is tossed with lemon juice or vinegar to prevent browning, then everything is stirred together vigorously so that the avocado breaks down a bit to add a glossy coating. Finish with a hit of red-pepper flakes for heat, or embellish with herbs, lettuces, beans, soft-boiled eggs, feta, nuts and so on.",
    "image": "https://static01.nyt.com/images/2021/07/13/dining/as-cucumber-avocado-saladd/merlin_189372006_a9ab5728-f86c-4727-aedf-3f1f6f4633b8-articleLarge.jpg",
    "priority": 0
  },
  {
    "name":"Sesame Tofu With Broccoli",
    "ingredients": ["Broccoli","Tofu"],
    "hyperlink":"https://www.bonappetit.com/recipe/sesame-tofu-with-broccoli",
    "description":"This recipe is a riff on a Chinese American classic, sesame chicken. Achieving a crispy coating around the tofu is key—it adds to the overall texture of the finished dish.",
    "image": "https://assets.bonappetit.com/photos/6019c57721494f6f6d02df99/1:1/w_2240,c_limit/Basically-SesameTofu-Broccoli-02.jpg",
    "priority": 0
  },
  {
    "name":"One-pan duck with Savoy cabbage",
    "ingredients": ["Cabbage","Duck"],
    "hyperlink":"https://www.bbcgoodfood.com/recipes/one-pan-duck-savoy-cabbage",
    "description":"Lightly score the skin of the duck breasts, then generously season with the peppercorns and a sprinkling of salt. Lay the duck breasts, skin-side down, in a non-stick sauté pan, then place over a low heat. Leave the duck for 15 mins to brown and release its fat, then flip over onto the flesh side for 5 mins. Remove the duck from the pan, then turn up the heat. Add the potatoes to the pan, fry until brown and crisp, then scatter over the parsley and garlic. Scoop out with a slotted spoon onto a plate, then season with salt. Keep the pan on the heat. Fry the bacon until crisp, then add the cabbage. Cook for 1 min, add a splash of water, then fry for 2 mins, just until the cabbage is wilted. While the cabbage is cooking, whisk any juices from the duck with the vinegar and olive oil. To serve, carve the duck breast into slices. Fan out on large dinner plates, spoon a neat bundle of cabbage on one side, then pile a serving of potatoes on the other. Drizzle over the dressing and serve.",
    "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10400_11-60041db.jpg?quality=90&webp=true&resize=440,400",
    "priority": 0
  },
  {
    "name":"SAUTÉED PORK BELLY WITH CAULIFLOWER",
    "ingredients": ["Cauliflower","Pork"],
    "hyperlink":"https://www.spicetheplate.com/pork/sauteed-pork-belly-with-cauliflower/",
    "description":"Sautéed pork belly with cauliflower is a popular dish frequently ordered at restaurants in China. With this recipe, you can easily recreate this tasty dish at home. Aside from roasting, if you are looking for new ways to serve cauliflower, this will be a great recipe to add to your collection.",
    "image": "https://i2.wp.com/www.spicetheplate.com/wp-content/uploads/2016/11/Pork-Belly-with-Cauliflower-7.jpg?w=680&ssl=1",
    "priority": 0
  },
  {
      "name":"BLT",
      "ingredients": ["Bacon", "Lettuce", "Tomato", "Bread"],
      "hyperlink":"https://themom100.com/recipe/the-ultimate-blt-sandwich/",
      "description": "The best BLT Sandwich needs a bit of discussion. Thick-cut bacon vs. regular, cooked to the perfect degree of crispness.  Buying good bacon vs. everyday bacon is worth the extra few bucks here.",
      "image": "https://themom100.com/wp-content/uploads/2019/08/ultimate-blt-sandwich-345-768x768.jpg",
      "priority": 0
    },
    {
      "name":"PBJ Bread",
      "ingredients": ["Peanut Butter", "Jelly", "Bread"],
      "hyperlink":"https://www.cakenknife.com/pbj-bread/",
      "description": "This PB&J bread really is the best way to start the day – or to snack on whenever you are hungry, which if you are anything like me, seems to be all the time… But seriously, it’s just so moist and just dense enough to be fantastically filling but not too over-indulgent. This bread is a new favorite of mine, and the fact that it takes minimal effort to make means that it has become a staple in our home.",
      "image": "https://www.cakenknife.com/wp-content/uploads/2014/03/PBJ-Bread_2.jpg",
      "priority": 0
    },
    {
      "name":"Chicken Alfredo",
      "ingredients": ["Chicken", "Alfredo Sauce", "Pasta"],
      "hyperlink":"https://bellyfull.net/chicken-alfredo-recipe/",
      "description": "This easy Chicken Alfredo recipe includes golden pan-fried seasoned chicken breasts and tender noodles, coated in the most dreamy cream sauce ever. A showstopper meal and it’s all done in just over 30 minutes!",
      "image": "https://bellyfull.net/wp-content/uploads/2021/02/Chicken-Alfredo-blog-4.jpg",
      "priority": 0
    },
    {
      "name":"Tomato Soup",
      "ingredients": ["Tomato", "Onion", "Butter"],
      "hyperlink":"https://www.inspiredtaste.net/27956/easy-tomato-soup-recipe/",
      "description": "Combine butter, onion, and tomatoes. Grab a Dutch oven or pot, place it over medium heat and melt the butter. Add half an onion that’s been cut into large wedges and a large can of tomatoes. Add water or broth and simmer. Bring everything to a low simmer, add some salt and leave it alone for about 40 minutes.",
      "image": "https://www.inspiredtaste.net/wp-content/uploads/2016/08/Tomato-Soup-Recipe-1-1200.jpg",
      "priority": 0
    },
    {
      "name":"Gilled Cheese Sandwich",
      "ingredients": ["Cheese", "Butter", "Bread"],
      "hyperlink":"https://natashaskitchen.com/grilled-cheese-sandwich/",
      "description": "Grilled cheese is a classic American sandwich that has been around since 1920. It is a hot sandwich made with buttered and toasted bread and originally filled with American cheese, but is now commonly made with one or more different cheeses.",
      "image": "https://natashaskitchen.com/wp-content/uploads/2021/08/Grilled-Cheese-Sandwich-3.jpg",
      "priority": 0
    },
    {
      "name":"HERB DIP WITH GREEK YOGURT AND ARUGULA",
      "ingredients": ["Arugula", "Yogurt"],
      "hyperlink":"https://confessionsofanover-workedmom.com/healthy-dip-recipes-herb-dip/",
      "description": "Do you love dipping vegetable sticks in dip as much as I do? If so, you are going to love this herb dip. It’s one of my favorite healthy dip recipes!",
      "image": "https://confessionsofanover-workedmom.com/wp-content/uploads/2013/11/healthy-dip-recipes-herb-dip.jpg",
      "priority": 0
    },
    {
      "name":"Honey-Mustard Pork Tenderloin with Kale",
      "ingredients": ["Pork", "Kale"],
      "hyperlink":"https://www.myrecipes.com/recipe/honey-mustard-pork-tenderloin-with-kale",
      "description": "To prepare pork, trim fat from pork. Combine pork and next 3 ingredients (pork through vinegar) in a large zip-top plastic bag. Seal and marinate in refrigerator for 2 hours, turning occasionally. Remove pork from bag, reserving marinade. Preheat oven to 375°. Place pork on a broiler pan coated with cooking spray. Insert meat thermometer into thickest portion of pork. Bake at 375° for 40 minutes or until thermometer registers 160° (slightly pink). Let stand 10 minutes before slicing. To prepare sauce, combine reserved marinade, 2 tablespoons honey, and next 5 ingredients (honey through 1 tablespoon mustard) in a small saucepan; bring to a boil. Reduce heat to medium; cook 15 minutes. Set aside. To prepare kale, combine kale, 1/4 cup chicken broth, 1 tablespoon mustard, and 1 tablespoon shallot in a large skillet over medium heat. Cover and cook 8 minutes or until tender.",
      "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F19%2F1999%2F03%2F01%2Fpork-tenderloin-ck-222925-x.jpg",
      "priority": 0
    },
    {
      "name":"HERB DIP WITH GREEK YOGURT AND ARUGULA",
      "ingredients": ["Arugula", "Yogurt"],
      "hyperlink":"https://confessionsofanover-workedmom.com/healthy-dip-recipes-herb-dip/",
      "description": "Do you love dipping vegetable sticks in dip as much as I do? If so, you are going to love this herb dip. It’s one of my favorite healthy dip recipes!",
      "image": "https://confessionsofanover-workedmom.com/wp-content/uploads/2013/11/healthy-dip-recipes-herb-dip.jpg",
      "priority": 0
    },
    {
      "name":"California Fish Lettuce Wraps",
      "ingredients": ["Fish", "Lettuce", "Avocado"],
      "hyperlink":"https://www.bettycrocker.com/recipes/california-fish-lettuce-wraps/bddf24b3-ac49-44ba-b511-81bc9d784bdb",
      "description": "Grilled fish, avocado aioli and fresh pico de gallo come together to create a Paleo-friendly dinner your whole family will love.",
      "image": "https://images-gmi-pmc.edge-generalmills.com/394c95e4-8a0b-4bd5-8937-c85b2350cf26.jpg",
      "priority": 0
    },
    {
      "name":"Crispy Szechuan-Style Eggplant and Tofu",
      "ingredients": ["Eggplant", "Tofu"],
      "hyperlink":"https://www.foodnetwork.com/recipes/jeff-mauro/crispy-szechuan-style-eggplant-and-tofu-2352484",
      "description": "In a shallow dish, combine 2/3 cup of the cornstarch, the salt and pepper. Toss the eggplant pieces in the cornstarch mixture to coat, shaking off the excess; set aside. Repeat the process with the tofu. Heat 1/2 inch of the peanut oil in a large, deep, straight-sided skillet over medium heat until it shimmers. Working in batches, cook the eggplant first, tossing gently until golden brown, about 3 minutes on each side. Transfer to a paper-towel-lined plate to drain. Repeat with the remaining eggplant and the tofu. In a small bowl, whisk together the chicken stock, soy sauce, vinegar, sugar, lime juice and remaining 2 teaspoons cornstarch. Carefully drain the oil from the skillet, and wipe out any residue using paper towels held with tongs. Add 1 tablespoon of peanut oil to the skillet and heat it over medium heat. Add the ginger, about 1 teaspoon of the minced chiles (or to taste) and the garlic. Cook, stirring, until just fragrant, about 30 seconds; pour in the chicken stock mixture and bring it to a simmer. Simmer until slightly thickened, 2 to 3 minutes. Add the cooked eggplant and tofu to the skillet and toss gently to combine. Stir in the sesame oil and remove from the heat. Serve immediately over rice and garnished with the remaining minced chiles if desired and chopped cilantro.",
      "image": "https://food.fnr.sndimg.com/content/dam/images/food/plus/fullset/2020/02/06/0/FNK-Live_111519-Crispy-Szechuan-Style-Eggplant-and-Tofu-0004_s4x3.jpg.rend.hgtvcom.826.620.suffix/1581032246330.jpeg",
      "priority": 0
    },
    {
      "name":"Stewed Pork and Squash",
      "ingredients": ["Squash", "Pork"],
      "hyperlink":"https://www.myrecipes.com/recipe/stewed-pork-squash",
      "description": "Heat oil in a large saucepan over medium-high heat. Add onion and garlic; sauté 2 minutes, stirring frequently. Add pork; cook 5 minutes, browning on all sides. Stir in chili powder, cumin, salt, and red pepper; cook 30 seconds, stirring constantly. Stir in broth and tomatoes; bring to a simmer. Cover, reduce heat, and simmer 1 1/2 hours or until pork is almost tender, stirring occasionally. Stir in butternut squash; simmer 30 minutes or until pork and squash are tender.",
      "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F19%2F2009%2F10%2F20%2Fpork-chili-ck-1932655-x.jpg",
      "priority": 0
    },
    {
      "name":"Easy One Skillet Creamy Cilantro Lime Chicken",
      "ingredients": ["Lime", "Chicken", "Cream"],
      "hyperlink":"https://gimmedelicious.com/easy-one-skillet-creamy-cilantro-lime-chicken/",
      "description": "This creamy cilantro lime chicken is extremely easy to make and has become a weekly part of our dinner routine. The chicken is tender and flavorful and the creamy sauce is just out of this world. The chicken can be served with a  side of veggies, rice, or even pasta.",
      "image": "https://gimmedelicious.com/wp-content/uploads/2016/09/creamy-skillet-cilantro-lime-chicken-5-of-12.jpg",
      "priority": 0
    },
    {
      "name":"Seared Duck & Dijon Pan Sauce",
      "ingredients": ["Corn", "Duck"],
      "hyperlink":"https://www.blueapron.com/recipes/seared-duck-dijon-pan-sauce-with-crispy-smashed-potatoes-corn",
      "description": "It’s the first recipe with our new premium duck breasts! They’re rich and juicy with a layer of skin that turns deliciously crispy once seared.",
      "image": "https://media.blueapron.com/recipes/24935/square_newsletter_images/1596744807-32-0010-7296/0907_2P12_Duck_142_SQ_Web.jpg?quality=80&width=850",
      "priority": 0
    },
    {
      "name":"Beef Stew with Carrots & Potatoes",
      "ingredients": ["Carrot", "Beef"],
      "hyperlink":"https://www.onceuponachef.com/recipes/beef-stew-with-carrots-potatoes.html",
      "description": "This classic French beef stew is the ultimate cold weather comfort food. After a few hours in the oven, the meat becomes meltingly tender and enveloped in a rich wine sauce.",
      "image": "https://i0.wp.com/www.onceuponachef.com/images/2011/02/beef-stew-with-carrots-potatoes.jpg?resize=1536%2C1068&ssl=1",
      "priority": 0
    },
    {
      "name":"Beef Stew with Carrots & Potatoes",
      "ingredients": ["Carrot", "Beef"],
      "hyperlink":"https://www.onceuponachef.com/recipes/beef-stew-with-carrots-potatoes.html",
      "description": "This classic French beef stew is the ultimate cold weather comfort food. After a few hours in the oven, the meat becomes meltingly tender and enveloped in a rich wine sauce.",
      "image": "https://i0.wp.com/www.onceuponachef.com/images/2011/02/beef-stew-with-carrots-potatoes.jpg?resize=1536%2C1068&ssl=1",
      "priority": 0
    },
    {
      "name":"Beef Stew with Carrots & Potatoes",
      "ingredients": ["Carrot", "Beef"],
      "hyperlink":"https://www.onceuponachef.com/recipes/beef-stew-with-carrots-potatoes.html",
      "description": "This classic French beef stew is the ultimate cold weather comfort food. After a few hours in the oven, the meat becomes meltingly tender and enveloped in a rich wine sauce.",
      "image": "https://i0.wp.com/www.onceuponachef.com/images/2011/02/beef-stew-with-carrots-potatoes.jpg?resize=1536%2C1068&ssl=1",
      "priority": 0
    },
    {
      "name":"Asparagus and Eggs",
      "ingredients": ["Asparagus", "Egg"],
      "hyperlink":"https://naturallyella.com/asparagus-and-eggs/",
      "description": "Of all the recipes I share, I love the ones that aren’t actually recipes. In fact, I love the meals that come together quickly, focus less on the exact measurement and more about what you have on hand. Moreover, since these meals can be so simple, it sometimes feels silly for me to write them down. For example, this asparagus and egg dish. In this case, you fry a few asparagus stalks, crack an egg or two in the pan with a bit of cheese and you’re done. It’s the perfect, quick meal for breakfast, lunch, or even a light dinner.",
      "image": "https://32lxcujgg9-flywheel.netdna-ssl.com/wp-content/uploads/2013/05/asparagus_and_eggs.jpg",
      "priority": 0
    },
]
